app/controllers/diymenus_controller.rb

  def index
    @diymenus = Diymenu.all
---
SELECT "diymenus".* FROM "diymenus"

  def show
    @diymenu = Diymenu.find(params[:id])
---
SELECT "diymenus".* FROM "diymenus" WHERE "diymenus"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @diymenu = Diymenu.new(params[:diymenu])

    respond_to do |format|
      if @diymenu.save
---
INSERT INTO "diymenus" ("created_at", "is_show", "key", "name", "parent_id", "public_account_id", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def generate_menu
    @current_public_account = PublicAccount.first
---
SELECT "public_accounts".* FROM "public_accounts" LIMIT 1