app/controllers/public_accounts_controller.rb

  def index
    @public_accounts = PublicAccount.all
---
SELECT "public_accounts".* FROM "public_accounts"